# Q1. List any five functions of the pandas library with execution.

1. read_csv()
2. head()
3. info()
4. describe()
5. corr()

In [2]:
import pandas as pd
import seaborn as sns
df = sns.load_dataset("tips")

In [40]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [42]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [43]:
df.corr()

            total_bill       tip      size
total_bill    1.000000  0.675734  0.598315
tip           0.675734  1.000000  0.489299
size          0.598315  0.489299  1.000000

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [51]:
data = {'A': [10, 20, 30], 
        'B': [40, 50, 60], 
        'C': [70, 80, 90]}
df = pd.DataFrame(data)
df

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [52]:
def reindex_dataframe(df):
    new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    df.index = new_index
    return df

new_df = reindex_dataframe(df)
new_df

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [53]:
data = { "Values" : [10, 20, 30, 40, 50] }
df = pd.DataFrame(data)
df.head()

   Values
0      10
1      20
2      30
3      40
4      50

In [54]:
def itrate(df):
    t = 0
    for i, j in df.iterrows():
        if i < 3:
            t += j["Values"]
    print("summation is : ", t)
    
itrate(df)

summation is :  60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [66]:
data = { "Text" : ["Jay Shree Ram", "Shyam mean, God is black color", "Sita is the most purest wonen", "Krishna says, yes I am God", "Nandlal mean Nand ke lal"] }
df = pd.DataFrame(data)
df.head()

                             Text
0                   Jay Shree Ram
1  Shyam mean, God is black color
2   Sita is the most purest wonen
3      Krishna says, yes I am God
4        Nandlal mean Nand ke lal

In [69]:
def word_count(df):
    df["Word_Count"] = df["Text"].apply(lambda x: len(str(x).split()))
    return df

word_count(df)

                             Text  Word_Count
0                   Jay Shree Ram           3
1  Shyam mean, God is black color           6
2   Sita is the most purest wonen           6
3      Krishna says, yes I am God           6
4        Nandlal mean Nand ke lal           5

# Q5. How are DataFrame.size() and DataFrame.shape() different?

df.size() 
- It give the number of cells present in a Dataframe. And It gives output in a integer format

df.shape
- It give the row and column values in a Dataframe. And it gives the output in a Tuple format

# Q6. Which function of pandas do we use to read an excel file?

- **pd.read_csv()** I used to read an excel file.

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
## The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [97]:
email_ids = ['johnsmith123@gmail.com', 'sarahbrown456@hotmail.com', 'jenniferlee789@yahoo.com', 'davidjones234@outlook.com', 'emilydavis321@gmail.com', 'michaelwilson567@hotmail.com', 'annabellejohnson890@yahoo.com', 'alexanderthomas432@outlook.com', 'olivialopez876@gmail.com', 'samuelgarcia543@hotmail.com']
df = pd.DataFrame(email_ids, columns=['Email'])
print(df)

                            Email
0          johnsmith123@gmail.com
1       sarahbrown456@hotmail.com
2        jenniferlee789@yahoo.com
3       davidjones234@outlook.com
4         emilydavis321@gmail.com
5    michaelwilson567@hotmail.com
6   annabellejohnson890@yahoo.com
7  alexanderthomas432@outlook.com
8        olivialopez876@gmail.com
9     samuelgarcia543@hotmail.com

In [98]:
df["Username"] = df["Email"].str.split("@", expand=True)[0]

In [99]:
df.head()

                       Email        Username
0     johnsmith123@gmail.com    johnsmith123
1  sarahbrown456@hotmail.com   sarahbrown456
2   jenniferlee789@yahoo.com  jenniferlee789
3  davidjones234@outlook.com   davidjones234
4    emilydavis321@gmail.com   emilydavis321

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
- For example, if df contains the following values:<br>
 A B C <br>
 3 5 1 <br>
 8 2 7 <br>
 6 9 4 <br>
 2 3 5 <br>
 9 1 2 <br>

- Your function should select the following rows: A B C <br>
 8 2 7 <br>
 9 1 2 <br>
- The function should return a new DataFrame that contains only the selected rows.

In [109]:
import numpy as np
data = np.random.randint(low=0, high=13, size=(10, 3))
df = pd.DataFrame(data, columns=['A', 'B', 'C'])
df.head()

    A   B  C
0   9  12  9
1   0  11  8
2  12   3  7
3  11   7  7
4   5   9  6

In [111]:
def make(df):
    new_df = df[(df["A"] > 5) & (df["B"] < 10)]
    return new_df
make(df)

    A  B   C
2  12  3   7
3  11  7   7
7  12  1   3
9   6  7  12

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [116]:
data = np.random.randint(low = 1, high = 20, size = (10, 1))
df = pd.DataFrame(data, columns=["Values"])
df.head()

   Values
0      10
1      14
2      11
3      13
4      17

In [119]:
print(df.mean(), "\n")
print(df.median(), "\n")
print(df.std(), "\n")

Values    12.3
dtype: float64

Values    13.5
dtype: float64

Values    4.595892
dtype: float64

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [6]:
import numpy as np

dates = pd.date_range('2023-01-01', periods=100)
sales = pd.Series(np.random.randint(300, 2000, size=100), name='sales')
df = pd.DataFrame({'date': dates, 'sales': sales})
df.head()

        date  sales
0 2023-01-01   1911
1 2023-01-02    321
2 2023-01-03   1210
3 2023-01-04   1870
4 2023-01-05   1281

In [10]:
def mov_avg(df):
    mo = df["sales"].rolling(window=7, min_periods = 1).mean()
    df["MovingAverage"] = mo
    return df

mov_avg(df)
df.head()

        date  sales  MovingAverage
0 2023-01-01   1911    1911.000000
1 2023-01-02    321    1116.000000
2 2023-01-03   1210    1147.333333
3 2023-01-04   1870    1328.000000
4 2023-01-05   1281    1318.600000

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:<br>
Date
- 2023-01-01
- 2023-01-02
- 2023-01-03
- 2023-01-04
- 2023-01-05<br>
Your function should create the following DataFrame:<br>

Date Weekday
- 2023-01-01 Sunday
- 2023-01-02 Monday
- 2023-01-03 Tuesday
- 2023-01-04 Wednesday
- 2023-01-05 Thursday<br>
The function should return the modified DataFrame.

**Note: Create your assignment in Jupyter notebook and upload it in GitHub & share that github repository link through your dashboard. Make sure the repository is public.**

In [12]:
dates = pd.date_range('2023-01-01', periods=100)
df = pd.DataFrame({"Date":dates})
df.head()

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [13]:
def week(df):
    df["Weekday"] = df["Date"].dt.day_name()
    return df
week(df)
df.head()

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [16]:
dates = pd.date_range('2023-01-01', periods=100)
df = pd.DataFrame({"Date":dates})
df.tail()

         Date
95 2023-04-06
96 2023-04-07
97 2023-04-08
98 2023-04-09
99 2023-04-10

In [19]:
def bet(df):
    tom = (df["Date"] >= "2023-01-01") & (df["Date"] <= "2023-01-31")
    final = df.loc[tom]
    return final
bet(df)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

 We need to import **pandas** library for using basic functions of pandas